public/programming/notes/algoritmi/10-sorting.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">

</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../notes.html">Notes</a> &gt; <a href="algoritmi.html">Algoritmi</a> &gt;
</p>

<div id="outline-container-org1b93242" class="outline-2">
<h2 id="org1b93242">Sorting</h2>
<div class="outline-text-2" id="text-org1b93242">
<p>
Algoritmi noti:
</p>

<ul class="org-ul">
<li>SelectionSort: \(\Theta (n^2)\)</li>
<li>InsertionSort: \(\Omega (n), O(n^2)\), iterativo. Adatto per piccoli
valori, sequenza quasi ordinate.</li>
<li>ShellSort: \(\Omega (n), O(n^{\frac{3}{2}})\), adatto per piccoli
valori, sequenze quasi ordinate.</li>
<li>MergeSort: \(\Theta (nlogn)\), richiede \(O(n)\) spazio aggiuntivo,
ricorsivo. Buona performance in cache, buona parallelizzazione.</li>
<li>HeapSort: \(\Theta (nlogn)\), sul posto, iterativo. Cattiva
performance in cache, cattiva parallelizzazione. Preferito in
sistemi embedded.</li>
<li>QuickSort: \(\Omega (nlogn), O(n^2)\) ricorsivo. Buona performance in
cache, buona parallelizzazione, buoni fattori moltiplicativi.</li>
</ul>

<p>
E' possibile dimostrare che qualunque algoritmo di ordinamento basato
su confronti ha una complessità \(\Omega (nlogn)\). Infatti si può
immaginare un qualunque algoritmo basato sui confronti come un albero
di decisione. L'altezza dell'albero rappresenta il numero di confronti
eseguiti nel caso pessimo, questa e' almeno \(logk\) con \(k\) numero di
foglie.
</p>
</div>

<div id="outline-container-org8570f3c" class="outline-3">
<h3 id="org8570f3c">Counting Sort</h3>
<div class="outline-text-3" id="text-org8570f3c">
<p>
Assumiamo che i numeri da ordinare sono compresi in un intervallo
\([1..k]\). Costruiamo un array \(B[1..k]\) che conta il numero di volte
che un valore compreso in \([1..k]\) compare in \(A\). Ricolloca i valori
cosi ottenuti nel vettore da ordinare \(A\).
</p>

<pre class="example">
countingSort(int[] A, int n, int k)
  int[] B = new int[1..k]
  for i=1 to k do
    B[i]=0
  for j=1 to n do
    B[A[j]]++;
  j=1
  for i=1 to k do
    while B[i]&gt;0 do
      A[j]=i
      j=j+1
      B[i]=B[i]-1
</pre>

<p>
Complessità \(O(n+k)\), se \(k=O(n)\) allora la complessità e'
\(O(n)\). Richiede \(O(k)\) memoria aggiuntiva.
</p>
</div>
</div>

<div id="outline-container-orgd96dda7" class="outline-3">
<h3 id="orgd96dda7">Pigeonhole Sort</h3>
<div class="outline-text-3" id="text-orgd96dda7">
<p>
Se i valori non sono numeri interi, ma record associati ad una chiave
da ordinare, possiamo usare una lista concatenata per chiave e poi
ordinare soltanto la chiave.
</p>

<p>
Complessità \(\Theta (n+k)\), richiede \(O(n+k)\) memoria
aggiuntiva. iterativo. Molto veloce quando \(k=O(n)\).
</p>
</div>
</div>

<div id="outline-container-orgbbbd600" class="outline-3">
<h3 id="orgbbbd600">Bucket Sort</h3>
<div class="outline-text-3" id="text-orgbbbd600">
<p>
Allora possiamo dividere l'intervallo in \(n\) sotto-intervalli di dimensione \(\frac{1}{n}\) detti bucket e poi distribuire gli \(n\) numeri nei bucket. Per l'ipotesi di uniformità, il numero atteso di valori nei bucket e' 1 dunque bucket può essere ordinato con Insertion Sort in \(O(n)\) ammortizzato.
</p>

<p>
Assumiamo che i valori siano reali ed uniformemente distribuiti
nell'intervallo \([0,1)\) o che qualunque insieme di valori distribuiti
uniformemente può essere normalizzato nell'intervallo \([0,1)\) in tempo
lineare.
</p>
</div>
</div>

<div id="outline-container-org3dc3b0d" class="outline-3">
<h3 id="org3dc3b0d">Proprietà degli algoritmi di ordinamento</h3>
<div class="outline-text-3" id="text-org3dc3b0d">
<p>
Un algoritmo di ordinamento e' detto <b><b>stabile</b></b> se preserva l'ordine
iniziale tra due elementi con la stessa chiave.
</p>

<ul class="org-ul">
<li>Gli algoritmi stabili già visti sono: Insertion Sort, Merge Sort e
Pigeonhole Sort.</li>
</ul>

<p>
Possiamo rendere qualunque algoritmo stabile usando come chiave di
ordinamento la coppia \((chiave,\ posizione\ iniziale)\).
</p>

<hr />

<p>
Travel: <a href="algoritmi.html">Algoritmi</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
